# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
# Importing libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%load_ext autoreload
%autoreload 2
%run functions.py

SyntaxError: invalid syntax (functions.py, line 165)

In [2]:
# Loading data

url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'

df = pd.read_csv(url)

df

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
# Checking df shape

df.shape

(4008, 11)

In [4]:
# Col names to lowercase

for col in range(len(df.columns)):
    df.columns.values[col] = df.columns.values[col].lower()

df.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [5]:
# Replacing spaces with underscores

df.columns = df.columns.str.replace(' ', '_')

df.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [6]:
# Replacing 'st' with 'state'

df = df.rename(columns = {'st': 'state'})

df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [7]:
# Checking unique values of 'gender' col

df['gender'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [8]:
# Standardizing 'gender' column values to 'F' and 'M'

replace_gender = {'Femal': 'F', 'female': 'F','Male': 'M'}

df['gender'] = df['gender'].replace(replace_gender)

df['gender'].unique()

array([nan, 'F', 'M'], dtype=object)

In [9]:
# Checking unique values of 'state' col

df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [10]:
# Standardizing 'state' column values

replace_state = {'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington'}

df['state'] = df['state'].replace(replace_state)

df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [11]:
# Replacing 'Bachelors' with 'Bachelor' in 'education'

df['education'] =  df['education'].replace('Bachelors', 'Bachelor')

df['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [12]:
# Removing '%' from 'customer_lifetime_value' and dividing by 100

df['customer_lifetime_value'] = df['customer_lifetime_value'].replace('%', '', regex=True).astype(float) / 100

display(df['customer_lifetime_value'].head())

0           NaN
1     6979.5359
2    12887.4317
3     7645.8618
4     5363.0765
Name: customer_lifetime_value, dtype: float64

In [13]:
# Standardizing 'vehicle_class' column values

replace_vehicles = {'Sports Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury'}

df['vehicle_class'] = df['vehicle_class'].replace(replace_vehicles)

df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [14]:
# Checking df data types

df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [15]:
# Casting 'customer_lifetime_value' as numeric

df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)

df['customer_lifetime_value'].dtype

dtype('float64')

In [16]:
# Checking unique values for 'number_of_open_complaints'

df['number_of_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [17]:
# Fixing 'number_of_open_complaints' format

# Splitting 'number_of_open_complaints' with backslash separator and keeping the 2nd value
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.split(pat='/').str[1]

# Casting 'number_of_open_complaints' as numeric
df['number_of_open_complaints'] = df['number_of_open_complaints'].astype(float)

display(df[['number_of_open_complaints']])

print(df['number_of_open_complaints'].unique())

      number_of_open_complaints
0                           0.0
1                           0.0
2                           0.0
3                           0.0
4                           0.0
...                         ...
4003                        NaN
4004                        NaN
4005                        NaN
4006                        NaN
4007                        NaN

[4008 rows x 1 columns]

[ 0.  2.  1.  3.  5.  4. nan]

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using `applymap()`.

In [18]:
# Identifying null values in all columns

df.isna().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

There seem to be 2937 rows full of null values in every column. This is a huge chunk of the dataframe, but it needs to go nonetheless as full null rows are useless.

The strategy will be the following:
- Perform a dropna to remove rows full of null values
- Check if the 2937 null values are gone from all the columns with the same number of nulls
- I will assume the gender is relevant for our business case, therefore my decision would be to also drop rows with missing values in the gender column. There is no way to know which gender corresponds to each client and it is quite dangerous to assume anyone's gender nowadays
- If there are still null values in the customer lifetime value column, fillna with the median

In [19]:
# Dropping rows with null values in every column

df = df.dropna(how='all')

df.isna().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [20]:
# Dropping rows with null values in 'gender' column

df = df.dropna(subset=['gender'])

df.isna().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      2
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [21]:
# Imputing median value for the 2 missing values in 'customer_lifetime_value'

# Calculating column median
lifetime_median = df['customer_lifetime_value'].median()

# Filling nulls in the column with that value
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(lifetime_median)

df.isna().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [22]:
# Converting number of complaints col to integer
df['number_of_open_complaints'] = df['number_of_open_complaints'].astype(int)

In [23]:
# Converting income col to integer
df['income'] = df['income'].astype(int)

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [24]:
# Identifying duplicated rows

dupe_count = df.duplicated().sum()

dupe_count

0

There are no duplicated rows in this dataframe.
If there were any, my approach to clean it would be to do a simple df.drop_duplicates(), with the default values. In this case it really does not matter which occurrence we keep.
Another approach would be to remove dupes of the 'customer' column, as it appears to contain the plate number of the car, which should be a unique identifier. The result would be the same as dropping full duped rows, though.

In [25]:
# Saving dataframe into a new csv file

df = df.reset_index(drop=True)

df.to_csv('clean_df.csv')
df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,QZ44356,Arizona,F,Bachelor,6979.5359,0,94.0,0,Personal Auto,Four-Door Car,1131.464935
1,AI49188,Nevada,F,Bachelor,12887.4317,48767,108.0,0,Personal Auto,Two-Door Car,566.472247
2,WW63253,California,M,Bachelor,7645.8618,0,106.0,0,Corporate Auto,SUV,529.881344
3,GA49547,Washington,M,High School or Below,5363.0765,36357,68.0,0,Personal Auto,Four-Door Car,17.269323
4,OC83172,Oregon,F,Bachelor,8256.2978,62902,69.0,0,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
949,TM65736,Oregon,M,Master,3059.5503,38644,78.0,1,Personal Auto,Four-Door Car,361.455219
950,VJ51327,California,F,High School or Below,20314.9976,63209,102.0,2,Personal Auto,SUV,207.320041
951,GS98873,Arizona,F,Bachelor,3239.1247,16061,88.0,0,Personal Auto,Four-Door Car,633.600000
952,CW49887,California,F,Master,4626.8011,79487,114.0,0,Special Auto,SUV,547.200000
953,MY31220,California,F,College,8997.0402,54230,112.0,0,Personal Auto,Two-Door Car,537.600000

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [26]:
%%writefile functions.py

# Writing functions in functions.py file

import pandas as pd
def clean_column_names(df: pd.DataFrame) -> pd.DataFrame:
    '''
    Modifies column names of a dataframe, changing them to lowercase and switching the spaces with underscores.
    '''
    new_cols = []
    for c in df.columns:
        new_c = c.lower().replace(' ', '_')
        new_cols.append(new_c)
    df.columns = new_cols
    return df



def st_to_state(df: pd.DataFrame) -> pd.DataFrame:
    '''
    Modifies a column name from 'st' to 'state'.
    '''
    if 'st' in df.columns:
        df.rename(columns={'st': 'state'}, inplace=True)
        return df
    else:
        'st column not found in the dataframe'

        
        
def remove_null_rows(df: pd.DataFrame) -> pd.DataFrame:
    '''
    Drops all rows from a dataframe in which all columns have null values.
    '''
    df.dropna(how='all', inplace=True)
    df.reset_index(drop=True, inplace=True)
    return df



def remove_duplicates(df: pd.DataFrame) -> pd.DataFrame:
    '''
    Removes fully duplicated rows from a dataframe and resets index.
    '''
    df.drop_duplicates(inplace=True)
    df.reset_index(drop=True, inplace=True)
    return df



def remove_nulls_col(df: pd.DataFrame, colname='gender') -> pd.DataFrame:
    '''
    Drops all rows from a dataframe where the value of a specific column (default='gender') is null.
    '''
    df.dropna(subset=[colname], inplace=True)
    df.reset_index(drop=True, inplace=True)
    return df



def fix_percentages(df: pd.DataFrame, colname='customer_lifetime_value') -> pd.DataFrame:
    '''
    Process values in a DataFrame column:
    - If the value is NaN, do nothing.
    - If the value contains '%', change to blank, convert to float, and divide by 100.
    - If it does not contain '%', convert to float.
    
    Parameters:
    - df: pandas DataFrame.
    - column_name: Name of the column to process.
    
    Returns:
    - processed_df: DataFrame with the processed values.
    '''
    def process_value(value):
        if pd.isna(value):
            return value
        elif '%' in str(value):
            return float(str(value).replace('%', '')) / 100
        else:
            return float(value)

    df[colname] = df[colname].apply(process_value)
    
    return df


def impute_nulls(df: pd.DataFrame, colname='customer_lifetime_value', method='median') -> pd.DataFrame:
    '''
    Imputes statistic value (default=median) for nulls values in a column (default='customer_lifetime_value').
    '''
    if colname not in df.columns:
        print(f"Column '{colname}' not found in the DataFrame.")
        return df

    if method == 'mean':
        fill_value = df[colname].mean()
    elif method == 'median':
        fill_value = df[colname].median()
    elif method == 'mode':
        fill_value = df[colname].mode().iloc[0]
    else:
        print("Invalid method. Defaulting to median.")
        fill_value = df[colname].median()

    df[colname].fillna(fill_value, inplace=True)
    return df



def standardize_gender_col(df: pd.DataFrame) -> pd.DataFrame:
    '''
    If the dataframe has a 'gender' column, replaces all values in it with their first letter in uppercase.
    '''
    if 'gender' in df.columns:
        df['gender'] = df['gender'].apply(lambda x: x[0].upper() if isinstance(x, str) else x)
        return df
    else:
        print('gender column not found in the dataframe')

        
        
def standardize_state_col(df: pd.DataFrame, options={'AZ': 'Arizona', 'Cali': 'California', 'WA': 'Washington'}) -> pd.DataFrame:
    '''
    If the dataframe has a 'state' column, replaces values in the column using dict mapping.
    '''
    if 'state' in df.columns:
        df['state'] = df['state'].replace(options)
        return df
    else:
        print('state column not found in the dataframe')

        
        
def bachelors_to_bachelor(df: pd.DataFrame, options={'Bachelors': 'Bachelor'}) -> pd.DataFrame:
    '''
    If the dataframe has a 'education' column, replaces 'Bachelors' with 'Bachelor'.
    '''
    if 'education' in df.columns:
        df['education'] = df['education'].replace(options)
        return df
    else:
        print('education column not found in the dataframe')        

        
               
def standardize_vehicle_class(df: pd.DataFrame, options={'Sports Car': 'Luxury', 'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury'}) -> pd.DataFrame:
    '''
    If the dataframe has a 'vehicle_class' column, replaces values in the column using dict mapping.
    '''
    if 'vehicle_class' in df.columns:
        df['vehicle_class'] = df['vehicle_class'].replace(options)
        return df
    else:
        print('vehicle_class column not found in the dataframe')
        
        
                
def fix_complaints_column(df: pd.DataFrame, colname='number_of_open_complaints') -> pd.DataFrame:
    '''
    - Takes a dataframe column (default='number_of_open_complaints')
    - If length of the column value is 1, leaves it as is
    - Else, splits the string by '/' and keeps the second value 
    '''
    def process_string(value):
        if len(str(value)) == 1:
            return value
        else:
            return int(value.split('/')[1])
    df[colname] = df[colname].apply(process_string)
    return df



def column_to_int(df: pd.DataFrame, colname='income') -> pd.DataFrame:
    '''
    Takes a dataframe column(default='income') and casts it to integer.
    '''
    df[colname] = df[colname].astype(int)
    return df


def clean_dataframe(df: pd.DataFrame) -> pd.DataFrame:
    '''
    Applies all previous cleaning and preprocessing functions to a dataframe.
    '''
    clean_column_names(df)
    st_to_state(df)
    remove_null_rows(df)
    remove_duplicates(df)
    remove_nulls_col(df)
    fix_percentages(df)
    impute_nulls(df)
    standardize_gender_col(df)
    standardize_state_col(df)
    bachelors_to_bachelor(df)
    standardize_vehicle_class(df)
    fix_complaints_column(df)
    column_to_int(df)
    return df

Overwriting functions.py

In [27]:
# Applying cleaning master function and checking results
%run functions.py
import functions

df_test = pd.read_csv(url)

df_test = clean_dataframe(df_test)

display(df_test)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,QZ44356,Arizona,F,Bachelor,6979.5359,0,94.0,0,Personal Auto,Four-Door Car,1131.464935
1,AI49188,Nevada,F,Bachelor,12887.4317,48767,108.0,0,Personal Auto,Two-Door Car,566.472247
2,WW63253,California,M,Bachelor,7645.8618,0,106.0,0,Corporate Auto,SUV,529.881344
3,GA49547,Washington,M,High School or Below,5363.0765,36357,68.0,0,Personal Auto,Four-Door Car,17.269323
4,OC83172,Oregon,F,Bachelor,8256.2978,62902,69.0,0,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
949,TM65736,Oregon,M,Master,3059.5503,38644,78.0,1,Personal Auto,Four-Door Car,361.455219
950,VJ51327,California,F,High School or Below,20314.9976,63209,102.0,2,Personal Auto,SUV,207.320041
951,GS98873,Arizona,F,Bachelor,3239.1247,16061,88.0,0,Personal Auto,Four-Door Car,633.600000
952,CW49887,California,F,Master,4626.8011,79487,114.0,0,Special Auto,SUV,547.200000
953,MY31220,California,F,College,8997.0402,54230,112.0,0,Personal Auto,Two-Door Car,537.600000

In [28]:
df_test.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int32
monthly_premium_auto         float64
number_of_open_complaints      int64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [29]:
df1 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')

df1 = clean_dataframe(df1)
df1

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,QZ44356,Arizona,F,Bachelor,6979.5359,0,94.0,0,Personal Auto,Four-Door Car,1131.464935
1,AI49188,Nevada,F,Bachelor,12887.4317,48767,108.0,0,Personal Auto,Two-Door Car,566.472247
2,WW63253,California,M,Bachelor,7645.8618,0,106.0,0,Corporate Auto,SUV,529.881344
3,GA49547,Washington,M,High School or Below,5363.0765,36357,68.0,0,Personal Auto,Four-Door Car,17.269323
4,OC83172,Oregon,F,Bachelor,8256.2978,62902,69.0,0,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
949,TM65736,Oregon,M,Master,3059.5503,38644,78.0,1,Personal Auto,Four-Door Car,361.455219
950,VJ51327,California,F,High School or Below,20314.9976,63209,102.0,2,Personal Auto,SUV,207.320041
951,GS98873,Arizona,F,Bachelor,3239.1247,16061,88.0,0,Personal Auto,Four-Door Car,633.600000
952,CW49887,California,F,Master,4626.8011,79487,114.0,0,Special Auto,SUV,547.200000
953,MY31220,California,F,College,8997.0402,54230,112.0,0,Personal Auto,Two-Door Car,537.600000

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [30]:
# Reviewing statistics for 'total_claim_amount' and 'customer_lifetime_value'

df[['total_claim_amount', 'customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count          954.000000               954.000000
mean           404.432066              7937.702030
std            299.211349              6252.928805
min              0.382107              2004.350700
25%            194.621742              4118.588600
50%            350.400000              5885.745300
75%            532.800000              9032.934700
max           2893.239678             44795.469400

In [31]:
# Calculating percentiles for filtering

# Calculating 'total_claim_amount' 75th percentile
claim_75 = df['total_claim_amount'].quantile(q=0.75)

# Calculating 'customer_lifetime_value' 25th percentile
value_25 = df['customer_lifetime_value'].quantile(q=0.25)

print('Total claim amount 75th percentile:', claim_75)
print('Customer lifetime value 25th percentile:', value_25)

Total claim amount 75th percentile: 532.8
Customer lifetime value 25th percentile: 4118.5886

In [32]:
# Filtering dataframe for customers in the top 25% total claim amount and botton 25% in customer lifetime value

df_filtered = df[(df['total_claim_amount'] > claim_75) & (df['customer_lifetime_value'] < value_25)]

print(df_filtered.shape)

df_filtered.head()

(35, 11)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
24,DS81757,Oregon,M,College,2470.1212,0,74.0,0,Personal Auto,Two-Door Car,721.242206
42,KA61892,Arizona,M,College,3873.6470,28142,105.0,0,Personal Auto,Luxury,701.708239
44,ND87334,California,M,High School or Below,2287.5969,0,63.0,0,Corporate Auto,Two-Door Car,679.368378
54,TS19868,California,M,College,2413.1397,27501,63.0,0,Personal Auto,Four-Door Car,542.319401
63,HH90090,California,F,Bachelor,4076.6347,29549,104.0,0,Personal Auto,Luxury,710.433775

In [33]:
# Changing float format for easier visual analysis

pd.set_option('display.float_format', '{:.2f}'.format)

In [34]:
# Calculating summary statistics for both filtered columns

df_filtered[['customer_lifetime_value', 'total_claim_amount']].describe()

       customer_lifetime_value  total_claim_amount
count                    35.00               35.00
mean                   3430.10              712.07
std                     575.41              145.44
min                    2287.60              537.60
25%                    2999.14              631.92
50%                    3667.38              679.37
75%                    3869.21              757.54
max                    4079.13             1185.99

In [35]:
# Retrieving summary statistics of the same columns in the original df for comparison

df[['customer_lifetime_value', 'total_claim_amount']].describe()

       customer_lifetime_value  total_claim_amount
count                   954.00              954.00
mean                   7937.70              404.43
std                    6252.93              299.21
min                    2004.35                0.38
25%                    4118.59              194.62
50%                    5885.75              350.40
75%                    9032.93              532.80
max                   44795.47             2893.24

It makes sense that mean and quartile values for customer lifetime value in the filtered df are substantially lower, while the same statistics for total claim amount are higher.

It is also normal that standard deviation is lower than in the unfiltered df, since values are more alike.

We should also note that there might be interest in analyzing some ocurrences not included in the filtered df. For example, the max total claim amount value is not included in the filtered df, which means it is not below the 25th percentile in lifetime value. It also amount for more than double the max value in the filtered df.